{
  "backend/main.mo": "Defines core backend actor with user profiles, worker profiles, bookings, admin settings, and credential-based admin authentication, integrating storage, authorization, Stripe, and migration mixins.",
  "backend/migration.mo": "Handles state upgrade by adding adminCredentials while preserving existing admin sign-in page settings.",
  "feature_evidence.json": "Feature evidence report documenting the admin credential sign-in feature and the frontend files involved.",
  "frontend-file-summaries.txt": "No summary available.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables and theming for light and dark modes.",
  "frontend/index.html": "Main HTML entry for the PWA including service worker registration, manifest links, and root mount element.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app name, theme colors, icons, and display settings for HandyConnect.",
  "frontend/public/offline.html": "Fallback offline page shown when the app has no network connection.",
  "frontend/public/sw.js": "Service worker managing asset caching, offline fallback, and automatic precaching of discovered resources.",
  "frontend/src/App.tsx": "Sets up global providers, error handling, and defines public, protected, and admin routes for the application using TanStack Router.",
  "frontend/src/components/admin/AdminQueryState.tsx": "Displays loading and error UI states for admin queries with optional retry support.",
  "frontend/src/components/admin/AdminRoleConfirmDialog.tsx": "Shows a confirmation dialog for granting or revoking admin privileges with optional block warnings.",
  "frontend/src/components/admin/AppSettingsPanel.tsx": "Provides UI for viewing and updating admin app settings and admin sign‑in page customization with validation and save handling.",
  "frontend/src/components/admin/UserControlPanel.tsx": "Allows admins to search users by principal, view results, copy IDs, and inspect user data with loading and error handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with navigation back to the worker browsing page.",
  "frontend/src/components/auth/RequireAccountType.tsx": "Gatekeeper component that redirects users without an account type to onboarding after loading.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects routes by verifying admin status and showing an access‑denied screen when unauthorized.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated via Internet Identity, redirecting to sign‑in if not.",
  "frontend/src/components/auth/RequireMaintenanceGate.tsx": "Blocks access during maintenance mode for non‑admin users and shows a maintenance screen.",
  "frontend/src/components/auth/RequireRole.tsx": "Restricts access based on user role and redirects to the correct dashboard if mismatched.",
  "frontend/src/components/bookings/BookingList.tsx": "Displays a list of bookings with status, details, and a link to view each booking, or an empty message if none exist.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a status badge with label and variant based on booking status.",
  "frontend/src/components/bookings/CreateBookingForm.tsx": "Form for creating a booking request with date/time, job details, and location inputs.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with top navigation, optional payment banner, content area, and footer.",
  "frontend/src/components/maintenance/MaintenanceScreen.tsx": "Full‑screen maintenance notice with sign‑out functionality.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing links based on account type and admin status, with authentication and mobile menu handling.",
  "frontend/src/components/workers/WorkerAvatar.tsx": "Displays a worker's avatar image or initials fallback, with size variants.",
  "frontend/src/components/workers/WorkerCard.tsx": "Worker profile summary card showing avatar, category, details, rate, and link to full profile.",
  "frontend/src/components/workers/WorkerProfileForm.tsx": "Form for creating or editing a worker profile, including fields, category selection, and image upload validation.",
  "frontend/src/config/subscription.ts": "Defines default subscription pricing and helpers for generating shopping items.",
  "frontend/src/hooks/useAccountType.ts": "Hook that returns the caller's account type and related convenience booleans.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and exposing login/logout state and helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin checks, admin sign‑in, settings, maintenance mode, and other backend interactions.",
  "frontend/src/index.css": "Configures Tailwind layers and theme variables for light and dark modes with custom color palettes and typography.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard UI with tabs for user management and application settings.",
  "frontend/src/pages/AdminSignIn.tsx": "Implements the admin sign‑in page supporting Internet Identity and credential login with redirects and error handling.",
  "frontend/src/pages/BookingDetail.tsx": "Displays detailed booking information, worker info, and status controls with permission checks and status updates.",
  "frontend/src/pages/BrowseWorkers.tsx": "Displays a worker browsing page with category filtering and rate sorting, using worker data from a query hook. Renders a hero section, filters, and a list of active workers.",
  "frontend/src/pages/ClientDashboard.tsx": "Shows the client's bookings, separating upcoming and past ones, with a link to browse workers. Uses booking data from a query hook and displays them via BookingList.",
  "frontend/src/pages/OnboardingAccountType.tsx": "Handles multi‑step user onboarding to select role, enter name, and optionally complete payment. Saves profile data, manages Stripe checkout, and handles session persistence.",
  "frontend/src/pages/PaymentFailure.tsx": "Displays a payment failure message and allows users to retry onboarding. Clears stored session data and redirects back to onboarding.",
  "frontend/src/pages/PaymentSuccess.tsx": "Verifies Stripe payment, confirms it on the backend, and redirects users based on onboarding state or account type. Handles loading and error states during verification.",
  "frontend/src/pages/SignIn.tsx": "Provides a sign‑in screen using Internet Identity; redirects authenticated users to browsing. Shows loading state during login and includes admin sign‑in link.",
  "frontend/src/pages/SubscriptionPaywall.tsx": "Blocks access when a user's grace period ends and prompts for subscription payment. Loads fee details, checks Stripe config, and redirects to checkout.",
  "frontend/src/pages/WorkerDashboard.tsx": "Displays a worker’s dashboard with profile completeness status and categorized booking lists using worker-specific queries.",
  "frontend/src/pages/WorkerDetail.tsx": "Shows detailed information for a specific worker and allows clients to submit booking requests, handling loading and error states.",
  "frontend/src/pages/WorkerProfile.tsx": "Provides a form for workers to create or edit their profile, including image upload/removal with progress tracking.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters, supporting hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing the HandyConnect app’s architecture, features, and current implementation state."
}