{
  "backend/main.mo": "Motoko backend managing user profiles, worker profiles, bookings, and access control with various query and update methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files across components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind base layer defining OKLCH‑based theme tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point containing root mount element and script loading the React app.",
  "frontend/src/App.tsx": "Main React app configuring routing, authentication guards, theming, and page structure using TanStack Router.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permissions, with navigation back to browsing.",
  "frontend/src/components/auth/RequireAccountType.tsx": "Guard that checks whether the user has selected an account type and redirects to onboarding if not.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard that waits for Internet Identity initialization and redirects unauthenticated users to sign‑in.",
  "frontend/src/components/auth/RequireRole.tsx": "Role‑based route guard that restricts access to pages based on the user's account type.",
  "frontend/src/components/bookings/BookingList.tsx": "Displays a list of bookings with status, details, and a link to view each booking, or shows an empty state card.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Maps booking statuses to labels and badge variants and renders a status badge.",
  "frontend/src/components/bookings/CreateBookingForm.tsx": "Form for creating a booking request with date, job details, and location fields.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing top navigation, main content area, and a footer.",
  "frontend/src/components/nav/TopNav.tsx": "Responsive top navigation bar showing links based on account type and login state with logout functionality.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card component displaying a worker’s profile summary, category, rate, and link to full profile.",
  "frontend/src/components/workers/WorkerProfileForm.tsx": "Form for creating or editing a worker profile including category, description, service area, rate, and active status.",
  "frontend/src/hooks/useAccountType.ts": "Hook that fetches the current user profile and exposes account type-related flags.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider handling auth client creation, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, worker profiles, workers list, and bookings through the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes with a custom earthy color palette.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BookingDetail.tsx": "Displays a single booking’s details, worker info, and allows clients or workers to update booking status.",
  "frontend/src/pages/BrowseWorkers.tsx": "Lists active workers with filtering by category and sorting options, including a hero section and UI filters.",
  "frontend/src/pages/ClientDashboard.tsx": "Shows a client’s upcoming and past bookings with navigation to browse workers.",
  "frontend/src/pages/OnboardingAccountType.tsx": "Guides new users through selecting an account type and entering their name before saving their profile.",
  "frontend/src/pages/SignIn.tsx": "Provides a sign‑in screen using Internet Identity and redirects authenticated users to browsing workers.",
  "frontend/src/pages/WorkerDashboard.tsx": "Displays the worker dashboard with profile-completion status and lists bookings grouped by status using fetched worker data.",
  "frontend/src/pages/WorkerDetail.tsx": "Shows detailed worker info, lets clients create bookings, and handles loading and missing-profile states.",
  "frontend/src/pages/WorkerProfile.tsx": "Provides a form for workers to create or update their profile, handling both creation and editing flows.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, and plugin setup for the app's UI.",
  "project_state.json": "Project metadata describing the current HandyConnect MVP features, versions, and requirement mappings."
}