{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles, worker profiles, and booking management with filtering and sorting utilities.",
  "feature_evidence.json": "Feature evidence report mapping PWA-related features to files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of major frontend source files and components.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark theme variables for the app.",
  "frontend/index.html": "Main HTML entry with PWA metadata, manifest link, icons, and service worker registration.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and icons.",
  "frontend/public/offline.html": "Standalone offline fallback page shown when no network connection is available.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, navigation fallback, and offline handling.",
  "frontend/src/App.tsx": "Configures the main app with theme, auth providers, and a full route tree including public, onboarding, and protected pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a button redirecting users to the browse workers page.",
  "frontend/src/components/auth/RequireAccountType.tsx": "Checks if the user has selected an account type and redirects to onboarding if not, showing a loading state when needed.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guards routes by requiring authentication, showing a loader during initialization and redirecting unauthenticated users.",
  "frontend/src/components/auth/RequireRole.tsx": "Restricts access based on user role and redirects to the appropriate dashboard when roles do not match.",
  "frontend/src/components/bookings/BookingList.tsx": "Renders a list of bookings with status, details, and links to booking pages, or an empty state if none exist.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Maps booking statuses to labels and badge styles and displays the corresponding badge.",
  "frontend/src/components/bookings/CreateBookingForm.tsx": "Form for creating a booking with fields for date, details, and location, submitting data via callback.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with top navigation, content area, and a footer.",
  "frontend/src/components/nav/TopNav.tsx": "Responsive top navigation bar showing role‑based links, logo, and sign‑out functionality.",
  "frontend/src/components/workers/WorkerCard.tsx": "Displays a worker’s profile summary including category, description, rate, and link to view full profile.",
  "frontend/src/components/workers/WorkerProfileForm.tsx": "A form component for creating or editing a worker profile, including category selection, description, service area, rate, and active status.",
  "frontend/src/hooks/useAccountType.ts": "Hook that retrieves the current user's account type and provides convenience booleans for client or worker roles.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, initializing identities, handling login/logout, and exposing login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, worker profiles, bookings, and browsing workers using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/BookingDetail.tsx": "Page showing detailed booking info, worker data, and actions for updating booking status with role-based behavior.",
  "frontend/src/pages/BrowseWorkers.tsx": "Displays a worker browsing page with category filtering and rate sorting, fetching active workers and rendering them in a card layout.",
  "frontend/src/pages/ClientDashboard.tsx": "Shows a client's upcoming and past bookings, with loading states and a link to browse workers.",
  "frontend/src/pages/OnboardingAccountType.tsx": "Handles user onboarding flow to choose an account type and enter a name, then saves the profile and redirects accordingly.",
  "frontend/src/pages/SignIn.tsx": "Provides a sign‑in screen using Internet Identity and redirects authenticated users to browsing.",
  "frontend/src/pages/WorkerDashboard.tsx": "Displays worker profile completeness and categorized booking lists, with loading states and profile editing navigation.",
  "frontend/src/pages/WorkerDetail.tsx": "Shows detailed worker info and allows clients to submit booking requests, handling loading and missing profiles.",
  "frontend/src/pages/WorkerProfile.tsx": "Renders a form to create or update a worker profile, handling save operations and loading states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container-query, and animation plugins.",
  "project_state.json": "JSON snapshot describing the project's feature set, versions, and functional summaries for authentication, routing, profiles, and roles."
}