{
  "backend/main.mo": "Main canister defines user profiles, worker data, bookings, payments, admin settings, and includes authorization, storage, Stripe config, and migration mixins.",
  "backend/migration.mo": "Migration module with a no-op run function returning the state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to touched frontend files, components, and related tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend source files in the project.",
  "frontend/index.css": "Base Tailwind styles defining theme color variables and light/dark mode tokens.",
  "frontend/index.html": "HTML entry point setting up PWA metadata, icons, service worker registration, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and categories.",
  "frontend/public/offline.html": "Standalone offline fallback page with simple styling and retry button.",
  "frontend/public/sw.js": "Custom service worker handling install, activate, asset caching, SPA fallback, and offline behavior.",
  "frontend/src/App.tsx": "Defines the application's routing structure, global error handler, and access-control wrappers using TanStack Router and themed layout components.",
  "frontend/src/components/admin/AdminCredentialResetDialog.tsx": "Provides a dialog for admins to reset credentials via phone number with validation, mutation handling, and success/error states.",
  "frontend/src/components/admin/AdminQueryState.tsx": "Renders loading and error UI states for admin data-fetching operations with optional retry support.",
  "frontend/src/components/admin/AdminRoleConfirmDialog.tsx": "Shows a confirmation dialog for granting or revoking admin roles, including blocked-state messaging and action handlers.",
  "frontend/src/components/admin/AppSettingsPanel.tsx": "Displays and updates admin-configurable app settings and admin sign‑in page settings with validation, dirty‑state tracking, and backend mutations.",
  "frontend/src/components/admin/UserControlPanel.tsx": "Allows admins to search for users by Principal ID, view results, and inspect or copy user details, with validation and query handling.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access‑denied message with a button redirecting users to the browse page.",
  "frontend/src/components/auth/RequireAccountType.tsx": "Guards routes by checking if a user has selected an account type, redirecting to onboarding when missing.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects admin routes by verifying admin status and displaying an access‑denied screen if unauthorized.",
  "frontend/src/components/auth/RequireAuth.tsx": "Enforces authentication by checking Internet Identity and redirecting unauthenticated users to the sign‑in page.",
  "frontend/src/components/auth/RequireMaintenanceGate.tsx": "Checks maintenance and admin status, showing a maintenance screen or children accordingly.",
  "frontend/src/components/auth/RequireRole.tsx": "Ensures user has the required account role, redirecting to the correct dashboard if not.",
  "frontend/src/components/bookings/BookingList.tsx": "Displays a list of bookings with key details and links, or an empty state when none exist.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a badge showing booking status with corresponding label and style variant.",
  "frontend/src/components/bookings/CreateBookingForm.tsx": "Form for submitting a new booking request with date, job details, and location fields.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper with top navigation, optional payment banner, main content, and footer.",
  "frontend/src/components/maintenance/MaintenanceScreen.tsx": "Displays a maintenance notice with sign‑out functionality during downtime.",
  "frontend/src/components/nav/TopNav.tsx": "Top navigation bar showing links based on user role, admin status, and authentication.",
  "frontend/src/components/workers/WorkerAvatar.tsx": "Shows a worker's avatar image or initials, supporting multiple size options.",
  "frontend/src/components/workers/WorkerCard.tsx": "Card displaying worker info, category, location, rate, and a link to their profile.",
  "frontend/src/components/workers/WorkerProfileForm.tsx": "Form component for creating or editing a worker profile, including fields, image upload, and category handling.",
  "frontend/src/config/subscription.ts": "Defines default subscription fee and utilities to create subscription ShoppingItem objects.",
  "frontend/src/hooks/useAccountType.ts": "Hook that retrieves the caller's account type and returns convenience booleans.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend APIs including admin actions, profiles, bookings, and payments.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, colors, and base styles for light and dark modes.",
  "frontend/src/main.tsx": "Application entrypoint that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for user management and app settings panels.",
  "frontend/src/pages/AdminSignIn.tsx": "Admin login page supporting Internet Identity, credential-based login, and bootstrap token flow with redirects based on admin status.",
  "frontend/src/pages/BookingDetail.tsx": "Displays detailed booking information, worker info, and allows clients or workers to update booking status.",
  "frontend/src/pages/BrowseWorkers.tsx": "Lists active workers with category filtering, rate-based sorting, and a hero section for browsing professionals.",
  "frontend/src/pages/ClientDashboard.tsx": "Shows a client's upcoming and past bookings with quick access to browse workers.",
  "frontend/src/pages/OnboardingAccountType.tsx": "Guides new users through selecting a role, entering a name, and completing optional Stripe payment before profile creation.",
  "frontend/src/pages/PaymentFailure.tsx": "Displays a payment failure message and allows the user to retry onboarding.",
  "frontend/src/pages/PaymentSuccess.tsx": "Verifies and confirms a Stripe payment session, then redirects the user to continue onboarding or access their dashboard.",
  "frontend/src/pages/SignIn.tsx": "Sign‑in page that triggers Internet Identity login and redirects authenticated users to the browse page.",
  "frontend/src/pages/SubscriptionPaywall.tsx": "Displays a paywall requiring a subscription fee and initiates a Stripe checkout session for payment.",
  "frontend/src/pages/WorkerDashboard.tsx": "Worker dashboard showing profile status and categorized booking lists with loading states.",
  "frontend/src/pages/WorkerDetail.tsx": "Shows a worker’s profile details and allows clients to submit booking requests with form handling and navigation.",
  "frontend/src/pages/WorkerProfile.tsx": "Worker profile creation/edit page handling profile data, image uploads, and update states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash‑based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme tokens, custom colors, animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Describes the project's overall state, feature set, and architecture for a React + Motoko home‑services marketplace MVP."
}