{
  "kind": "build_request",
  "title": "Convert HandyConnect into an installable PWA",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Add a Web App Manifest for HandyConnect and wire it into the app so the site is recognized as a PWA (name, short_name, start_url, display=standalone, theme_color, background_color, icons).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it a PWA"
        ]
      },
      "acceptanceCriteria": [
        "A manifest file is present in the frontend static assets and is linked from the HTML entry point.",
        "The manifest includes at least 192x192 and 512x512 icons and is valid JSON.",
        "On Android Chrome, the site is eligible for \"Add to Home screen\" / \"Install app\"."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Implement a service worker that enables app-shell offline support by precaching the built static assets and serving the SPA entry (index.html) for navigation requests; include an offline fallback for uncached requests when the user is offline.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it a PWA"
        ]
      },
      "acceptanceCriteria": [
        "A service worker file exists in frontend static assets and is registered by the app (without modifying immutable files).",
        "After the first load, the app can be reopened while offline and renders the app shell (or an explicit offline fallback page) instead of a browser error.",
        "Navigation to client-side routes while offline returns the SPA entry (index.html) rather than a network 404."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the HTML entry point to include required PWA metadata (manifest link, theme-color meta, and any necessary Apple PWA meta tags) and to register the service worker at runtime (without editing frontend/src/main.tsx or other immutable paths).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it a PWA"
        ]
      },
      "acceptanceCriteria": [
        "frontend/index.html includes a <link rel=\"manifest\"> and a theme-color meta tag consistent with the app theme.",
        "Service worker registration occurs from a non-immutable file (e.g., index.html) and succeeds in production builds.",
        "PWA install prompt eligibility is achieved in Lighthouse (Installable criteria met)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui.",
    "Keep the backend architecture unchanged (single Motoko actor); no backend changes are required for PWA enablement."
  ],
  "nonGoals": [
    "Generating an Android APK or publishing to Google Play.",
    "Adding push notifications or background sync.",
    "Changing authentication (Internet Identity) behavior."
  ],
  "imageRequirements": {
    "required": [
      "App icon in a bold, clean handyman/tools marketplace style (pwa-icon-192.dim_192x192.png)",
      "App icon in a bold, clean handyman/tools marketplace style (pwa-icon-512.dim_512x512.png)",
      "Maskable app icon variant with safe padding around the mark (pwa-icon-maskable-512.dim_512x512.png)"
    ],
    "edits": []
  }
}