{
  "kind": "build_request",
  "title": "Add admin username/password login with specified credentials",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-43",
      "text": "Add a separate Admin Sign-In option that authenticates using a username and password (in addition to the existing Internet Identity admin sign-in flow), using these initial credentials exactly: username/id = \"adminumar\" and password = \"umar9945\".",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make admin login user id and password as mantioning ID-adminumar, password- umar9945"
        ]
      },
      "acceptanceCriteria": [
        "The Admin Sign-In page provides a username/id + password form.",
        "Submitting username \"adminumar\" with password \"umar9945\" successfully signs the user into the admin area (/app/admin).",
        "Submitting any other username/password combination shows an English error message and does not grant admin access.",
        "The existing Internet Identity-based admin sign-in flow continues to work as it does today."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Implement backend support for verifying the admin username/password and establishing an admin-authenticated session state that the frontend can use for route protection and for calling admin-only backend methods.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make admin login user id and password as mantioning ID-adminumar, password- umar9945"
        ]
      },
      "acceptanceCriteria": [
        "There is a backend method that validates the submitted username/password and returns a success/failure response.",
        "After successful username/password login, admin-only routes are accessible and admin-only backend methods can be called successfully from the frontend.",
        "After unsuccessful username/password login, admin-only routes remain blocked."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Persist the admin username/password authentication configuration across canister upgrades with the initial default values set to username/id \"adminumar\" and password \"umar9945\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make admin login user id and password as mantioning ID-adminumar, password- umar9945"
        ]
      },
      "acceptanceCriteria": [
        "After upgrading the canister, the configured admin username/password login still works with the same credentials."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Use English for any user-facing text.",
    "Preserve the exact provided credentials as the initial configured admin login: username/id \"adminumar\", password \"umar9945\"."
  ],
  "nonGoals": [
    "Do not remove or replace the existing Internet Identity authentication flow for normal users.",
    "Do not add third-party authentication providers (only Internet Identity is supported).",
    "Do not introduce additional backend services or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}