{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin username/password sign-in option (alongside Internet Identity)",
  "requirements": [
    {
      "id": "REQ-43",
      "summary": "Add an Admin Sign-In option using username/id + password that grants access to /app/admin for the configured credentials while keeping the existing Internet Identity admin sign-in flow unchanged.",
      "acceptanceCriteria": [
        "The Admin Sign-In page provides a username/id + password form.",
        "Submitting username \"adminumar\" with password \"umar9945\" successfully signs the user into the admin area (/app/admin).",
        "Submitting any other username/password combination shows an English error message and does not grant admin access.",
        "The existing Internet Identity-based admin sign-in flow continues to work as it does today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSignIn.tsx",
          "operation": "modify",
          "description": "Add a username/id + password sign-in form option that calls the backend capability for credential validation (adminSignInWithCredentials) and navigates to /app/admin on success; show an English error message on failure; keep the existing Internet Identity admin sign-in UI/behavior intact. Use existing UI components (do not edit anything under frontend/src/components/ui)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to support credential-based admin session checks and actions needed by route protection and UI (e.g., query isAdminLoggedIn and mutation logOutAdmin), using the existing backend actor methods. Ensure queries are enabled with an available actor and use stable query keys so admin session state updates correctly."
        },
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "modify",
          "description": "Extend the admin route guard to allow access if either (1) the caller is an Internet Identity admin (existing check) or (2) a credential-based admin session is active (new isAdminLoggedIn check). Continue to show the existing loading state and access denied screen for unauthorized users."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update /app/admin route wiring so the admin dashboard is protected by the updated admin guard logic that supports both Internet Identity admin and credential-based admin session access, while preserving the current behavior for the Internet Identity flow."
        },
        {
          "path": "frontend/src/components/nav/TopNav.tsx",
          "operation": "modify",
          "description": "Update admin navigation visibility and logout behavior to account for credential-based admin sessions: show the Admin link when the user is admin via Internet Identity or has an active credential-based admin session; on sign out, also call the backend capability to end the admin credential session (logOutAdmin) in addition to the existing Internet Identity logout + query cache clear."
        }
      ]
    }
  ]
}