{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "HandyConnect is a React + Motoko (Internet Computer) home-services marketplace MVP. Users authenticate with Internet Identity, complete onboarding by selecting an account type (client or worker) and saving a basic user profile, then optionally pay a one-time subscription fee via Stripe Checkout. Clients can browse active worker profiles and create booking requests; workers can create/update their service profiles (category, description, service area, hourly rate, active status, phone number) and manage bookings through a controlled status lifecycle (requested → accepted/declined; accepted → completed; requested → cancelled by client). The backend includes admin settings (maintenance mode, app name, subscription fee), Stripe configuration, user listing/search, and an admin sign-in page customization API. The frontend is a TanStack Router SPA using React Query for canister calls, includes route guards (auth/account-type/role/admin/maintenance), a responsive navigation shell with a payment reminder banner, payment success/failure routes, and PWA offline support via a service worker + offline fallback page.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login, session restore, logout)",
      "synonyms": [
        "Internet Identity",
        "AuthClient",
        "DelegationIdentity"
      ],
      "description": "Provides an authentication context using @dfinity/auth-client that initializes/restores a stored identity, supports interactive login against an Internet Identity provider, and supports logout/clear with UI status flags for loading and errors.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-scoped canister actor creation and cache refresh",
      "synonyms": [
        "useActor",
        "identity-bound actor",
        "actor bootstrap"
      ],
      "description": "Creates an anonymous canister actor when unauthenticated and an identity-bound actor when authenticated. When the identity changes, it invalidates and refetches non-actor React Query caches so UI data rehydrates under the new principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secret parameter handling via URL hash + sessionStorage",
      "synonyms": [
        "caffeineAdminToken",
        "URL hash secret",
        "sessionStorage secret persistence"
      ],
      "description": "Utilities read secrets from the URL hash fragment, persist them in sessionStorage for the session, and remove them from the URL via history.replaceState to reduce leakage; used for access-control initialization.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control with bootstrap admin secret (Motoko)",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "first-admin bootstrap"
      ],
      "description": "Implements roles (#admin/#user/#guest) stored per principal. An initialization endpoint registers the first admin when a user-provided secret matches an environment token; otherwise the caller becomes a #user. Exposes role queries and admin checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Route protection and role-based gating",
      "synonyms": [
        "RequireAuth",
        "RequireAccountType",
        "RequireRole",
        "RequireAdmin",
        "RequireMaintenanceGate"
      ],
      "description": "Uses TanStack Router and guard components to protect routes by authentication, onboarding completion (account type present), role (client/worker), admin access, and maintenance mode (non-admin users blocked when enabled).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Responsive navigation shell with role-aware links and logout",
      "synonyms": [
        "AppShell",
        "TopNav",
        "responsive navigation"
      ],
      "description": "Provides a consistent layout with responsive top navigation and role-adaptive links (client/worker). Logout clears the Internet Identity session and clears the React Query cache; admin logout additionally calls a backend admin logout endpoint when applicable.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Onboarding flow (role selection, name entry, optional payment step)",
      "synonyms": [
        "OnboardingAccountType",
        "role selection",
        "name capture"
      ],
      "description": "Multi-step onboarding flow that stores role/name in sessionStorage for continuity. Users can proceed to Stripe payment or skip payment and still create a basic profile (with a 2-day payment grace period enforced by the backend).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Subscription fee configuration and retrieval",
      "synonyms": [
        "subscriptionFeeInCents",
        "useGetSubscriptionFee",
        "admin subscription pricing"
      ],
      "description": "Admin-managed subscription fee is stored in backend admin settings and fetched by the frontend for onboarding and paywall pricing; frontend uses a default fallback fee if backend value is unavailable.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Stripe configuration management and configured-state checks",
      "synonyms": [
        "StripeConfiguration",
        "isStripeConfigured",
        "setStripeConfiguration"
      ],
      "description": "Admins can configure Stripe (secret key + allowed countries). The frontend checks whether Stripe is configured before enabling payment initiation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Stripe Checkout session creation via ICP HTTPS outcalls",
      "synonyms": [
        "createCheckoutSession",
        "ShoppingItem",
        "http_request outcall"
      ],
      "description": "Backend creates Stripe Checkout sessions using HTTPS outcalls; frontend constructs success/cancel URLs, requests session creation, parses returned JSON for session URL, and redirects the user to Stripe-hosted Checkout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Payment success/failure routing with verification + confirmation",
      "synonyms": [
        "PaymentSuccess",
        "PaymentFailure",
        "getStripeSessionStatus",
        "confirmPaymentSuccessful"
      ],
      "description": "After Stripe redirect, the frontend verifies the session status with the backend and then confirms payment to mark the principal as paid. Failure route supports retrying onboarding/payment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Subscription tracking with grace period and enforcement",
      "synonyms": [
        "PaymentStatus",
        "SubscriptionPayment",
        "2-day grace period"
      ],
      "description": "Backend creates a pending subscription payment record on first profile save with a 2-day grace-period end timestamp. Many authenticated endpoints trap when grace expires and payment is not completed; frontend includes a dedicated paywall and a global unhandled rejection handler to redirect subscription errors to the paywall.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Maintenance mode setting and maintenance gate",
      "synonyms": [
        "AdminSettings.maintenanceMode",
        "RequireMaintenanceGate",
        "MaintenanceScreen"
      ],
      "description": "Admins can toggle maintenance mode. When enabled, non-admin users are blocked from using the app and shown a maintenance screen with a sign-out option; admins retain access.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Admin dashboard with user listing and principal search",
      "synonyms": [
        "AdminDashboard",
        "UserControlPanel",
        "listAllUsers",
        "searchUserByPrincipal"
      ],
      "description": "Admin UI supports listing all registered users and searching for a user by Principal ID with input validation and copy-to-clipboard. Backend restricts these endpoints to admins.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Admin application settings management (app name, subscription fee, maintenance)",
      "synonyms": [
        "getAdminSettings",
        "updateAdminSettings",
        "AppSettingsPanel"
      ],
      "description": "Admin UI reads and updates backend admin settings including app name, subscription fee in cents (edited as USD in the UI), and maintenance mode, with dirty-state tracking and validation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Admin sign-in page customization (public settings)",
      "synonyms": [
        "AdminSignInPagePublicSettings",
        "getAdminSignInPageSettings",
        "updateAdminSignInPageSettings"
      ],
      "description": "Backend exposes public admin sign-in page text settings (title/subtitle/helper text) without requiring admin auth; admins can update these settings via a protected endpoint and UI panel.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Admin credential reset UI and mutation hook (phone-based recovery)",
      "synonyms": [
        "AdminCredentialResetDialog",
        "useResetAdminCredentialsByPhoneNumber",
        "credential recovery"
      ],
      "description": "Frontend provides a dialog accessible from the Admin Sign In page allowing entry of recovery phone number, new username, new password, and password confirmation; it calls a backend reset endpoint and invalidates admin auth queries on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Backend admin credential reset endpoint with basic cooldown",
      "synonyms": [
        "resetAdminCredentialsByPhoneNumber",
        "adminRecoveryPhoneNumber",
        "rate limiting"
      ],
      "description": "Backend stores an admin recovery phone number and implements a phone-number-based admin credential reset endpoint that returns a generic boolean result and enforces a cooldown between attempts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Worker profile management (create/update)",
      "synonyms": [
        "createWorkerProfile",
        "updateWorkerProfile",
        "WorkerProfileForm"
      ],
      "description": "Workers can create and edit their service profile including display name, category (including #other with custom text), description, service area, hourly rate, active visibility flag, and phone number.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Worker profile images stored as ExternalBlob (upload/remove) with progress UI",
      "synonyms": [
        "ExternalBlob",
        "uploadProfileImage",
        "removeProfileImage",
        "WorkerAvatar"
      ],
      "description": "Workers can upload/remove profile images stored as ExternalBlob. The UI validates file type/size, supports previews, shows upload progress, and renders avatars via direct blob URLs with initials/icon fallback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Worker discovery and detail pages with filtering/sorting and booking CTA",
      "synonyms": [
        "BrowseWorkers",
        "WorkerCard",
        "WorkerDetail"
      ],
      "description": "Authenticated users browse worker profiles and filter by category and sort by hourly rate. Worker detail pages show service details and (for clients) allow initiating a booking request when the worker is active.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Bookings (create, view, list, and controlled status transitions)",
      "synonyms": [
        "createBookingRequest",
        "getBooking",
        "getBookingsByClient",
        "getBookingsByWorker",
        "updateBookingStatus"
      ],
      "description": "Clients can create booking requests for workers. Both client and worker can view booking details. Status transitions are permissioned and validated in the backend; frontend provides booking lists, a booking detail view, and status action buttons.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Role-based dashboards (client and worker) with booking grouping and worker profile completeness indicator",
      "synonyms": [
        "ClientDashboard",
        "WorkerDashboard",
        "BookingList"
      ],
      "description": "Client dashboard groups bookings into upcoming/active vs past. Worker dashboard groups bookings by status and shows a profile completeness indicator with a CTA to complete/edit the worker profile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Blob-storage maintenance utilities (gateway auth, blob GC tooling)",
      "synonyms": [
        "MixinStorage",
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete"
      ],
      "description": "Backend includes blob-storage helper endpoints for updating authorized gateway principals, listing dead blobs for deletion, confirming deletion, and topping up cycles via a cashier canister principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "PWA installability and offline support",
      "synonyms": [
        "manifest.webmanifest",
        "service worker",
        "offline.html"
      ],
      "description": "Implements an installable PWA with a webmanifest and icons, a service worker that caches app shell/static assets and provides SPA navigation fallback, and a branded offline page for offline scenarios.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "State migration for admin credentials + recovery phone and worker blob compatibility",
      "synonyms": [
        "backend/migration.mo",
        "upgrade migration"
      ],
      "description": "Includes a migration module executed on upgrade that carries forward existing actor state, seeds default admin credentials when missing, adds an admin recovery phone number field, and maps worker profile blob fields into the new state structure.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-eliminate-duplicate-react-query-internet-identity-provider-initialization-by-ensuring-the-app-only-has-one-queryclientprovider-and-one-internetidentityprovider-active-at-runtime-without-modifying-any-frontend-immutable-paths",
      "title": "Eliminate duplicate React Query + Internet Identity provider initialization by ensuring the app only has one QueryClientProvider and one InternetIdentityProvider active at runtime, without modifying any frontend immutable paths.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-admin-sign-in-ui-to-support-secure-ii-based-admin-access-allow-the-user-to-sign-in-with-internet-identity-then-if-they-are-authenticated-but-not-an-admin-present-a-token-based-admin-bootstrap-form-that-calls-the-new-backend-bootstrap-endpoint-and-redirects-to-app-admin-upon-success",
      "title": "Update the Admin Sign-In UI to support secure II-based admin access: allow the user to sign in with Internet Identity, then if they are authenticated but not an admin, present a token-based admin bootstrap form that calls the new backend bootstrap endpoint and redirects to /app/admin upon success.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-admin-route-protection-uses-a-single-correct-source-of-truth-for-admin-status-derived-from-internet-identity-and-that-app-admin-access-works-end-to-end-after-a-successful-bootstrap-on-a-fresh-identity",
      "title": "Ensure admin route protection uses a single, correct source of truth for admin status derived from Internet Identity, and that /app/admin access works end-to-end after a successful bootstrap on a fresh identity.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Set up secure Internet Identity–based admin access so the user can log into the admin portal (admin auth/role assignment via II rather than broken credentials flow).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a secure Internet Identity (II) admin bootstrap endpoint in the Motoko backend that can elevate the caller to admin using a secret token, without requiring the caller to already be an admin, and without trapping when the token is not configured.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Fix the current admin credential sign-in behavior in the backend so it does not fail due to requiring the caller to already be admin when assigning admin role (i.e., make the sign-in function capable of elevating a non-admin caller when authentication is successful), or explicitly disable credential-based elevation in favor of II token bootstrap and reflect that in the response behavior.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "ICP canister backend written in Motoko; the main actor composes functionality via mixins (authorization and blob-storage utilities) and a migration hook (upgrade-safe state transformation).",
    "Authorization is centralized in an AccessControl module with roles (#admin/#user/#guest) and a bootstrap initialization flow gated by an environment token (CAFFEINE_ADMIN_TOKEN) passed from the frontend via a URL-hash secret.",
    "Frontend is a React SPA using TanStack Router with composable route guards (RequireAuth/RequireAccountType/RequireRole/RequireAdmin/RequireMaintenanceGate).",
    "Backend calls are wrapped in @tanstack/react-query hooks (queries + mutations) with targeted invalidation after writes (e.g., settings changes, bookings updates, profile edits).",
    "Stripe integration is implemented via ICP HTTPS outcalls (IC.http_request) with a deterministic transform that strips headers to keep responses deterministic.",
    "Subscription enforcement is implemented server-side using per-principal payment status and a grace-period timestamp; admins bypass subscription checks.",
    "Blob/profile-image support uses an ExternalBlob type (ICP storage primitives) with direct URL rendering in the UI and upload progress callbacks on the client.",
    "Admin settings are split into (a) admin-only operational settings (maintenance/app name/subscription fee) and (b) public, non-sensitive admin sign-in page text settings retrievable without admin auth.",
    "PWA support includes a webmanifest, service worker caching with SPA navigation fallback, and a branded offline page.",
    "Frontend design system uses Tailwind + shadcn/ui primitives (cards, dialogs, tables, alerts, inputs, etc.) for consistent styling."
  ],
  "known_issues": [
    "Frontend provider duplication: frontend/src/main.tsx wraps App with QueryClientProvider and InternetIdentityProvider, while frontend/src/App.tsx also creates its own QueryClientProvider and InternetIdentityProvider; this can cause split caches, inconsistent identity state, and double initialization.",
    "Admin credential login appears broken: backend/adminSignInWithCredentials calls AccessControl.assignRole, which requires the caller to already be admin; this prevents credential-based elevation from #user/#guest to #admin as implemented.",
    "Admin credential storage is insecure: backend stores admin username/password in plaintext in canister state and migration also seeds plaintext defaults; no hashing/salting is implemented.",
    "Admin reset cooldown is global (single lastResetAttemptTime) rather than per-principal/IP; any caller can effectively rate-limit all resets (DoS) and the policy is coarse.",
    "Access control bootstrap can be bricked: if the first authenticated caller initializes without the correct secret, they are stored as #user and later calls won’t promote them, potentially leaving no admin.",
    "Authenticated actor creation always calls _initializeAccessControlWithSecret; if CAFFEINE_ADMIN_TOKEN is unset on the canister, authenticated usage traps, breaking the app for signed-in users.",
    "Backend includes adminCount/adminPrincipals and related role-change query APIs, but these are not updated when admin roles change via AccessControl; outputs can be incorrect or empty.",
    "Service worker precaching discovers assets by regex-parsing index.html, which is brittle with hashed/chunked builds and may miss required resources.",
    "BrowseWorkers UI filtering does not support the backend’s #other(Text) category (the filter builder returns null for “other”), so “other” workers can’t be filtered by category.",
    "Route gating vs subscription enforcement: getCallerUserProfile traps when grace period is expired; components that rely on it (e.g., RequireAccountType) do not explicitly handle query errors, which may lead to confusing redirects or blank states depending on React Query error handling."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "HandyConnect",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}