{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "HandyConnect is a mobile-friendly web MVP for a local services marketplace on the Internet Computer: users authenticate with Internet Identity, choose an account type (client or worker), workers create public service profiles, clients browse workers and request bookings, and both parties manage bookings through a simple status lifecycle enforced by the Motoko backend.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication with session persistence and logout",
      "synonyms": [
        "II auth",
        "Internet Identity login",
        "Delegation-based authentication"
      ],
      "description": "Provides login/logout via Internet Identity using @dfinity/auth-client, persists delegations across reloads, exposes auth state through a React context, and gates access to authenticated areas with loading and redirect behavior.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor management with identity-aware initialization",
      "synonyms": [
        "useActor",
        "Actor factory",
        "React Query actor caching"
      ],
      "description": "Creates an anonymous or authenticated canister actor depending on identity, calls the canister auth initializer, and invalidates/refetches dependent React Query caches when identity (and therefore the actor) changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Motoko access control with admin bootstrap and role assignment",
      "synonyms": [
        "AccessControl",
        "Admin token bootstrap",
        "Role-based permissions"
      ],
      "description": "Implements roles (#admin/#user/#guest). The first caller providing a matching secret becomes admin; others become users. Admins can assign roles. Permission checks are used to guard profile and booking endpoints.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "User profile storage (name + account type) and retrieval",
      "synonyms": [
        "Account type profile",
        "Caller profile"
      ],
      "description": "Stores and retrieves a per-principal UserProfile containing name and optional accountType (client/worker). Includes getCallerUserProfile and saveCallerUserProfile used by onboarding and role checks.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Onboarding flow to choose account type and set display name",
      "synonyms": [
        "Role selection onboarding",
        "First-time setup"
      ],
      "description": "After first sign-in, users are required to choose Client or Worker and enter their name. The chosen account type is persisted in the backend user profile and used to route users to the correct dashboard.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Route protection and role-based navigation",
      "synonyms": [
        "RequireAuth",
        "RequireAccountType",
        "RequireRole",
        "Role-adaptive TopNav"
      ],
      "description": "Uses TanStack Router with guard components to enforce authentication and onboarding completion. Restricts worker-only pages (dashboard/profile) and client-only dashboard. Top navigation adapts links based on account type and supports responsive mobile menu + logout.",
      "reqIds": [
        "REQ-17"
      ],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Worker profile creation and editing (owner-only updates)",
      "synonyms": [
        "Worker listing profile",
        "Service provider profile"
      ],
      "description": "Workers can create and update a profile containing display name, service category, description, service area, hourly rate, and active visibility. Backend enforces that only the owning principal can update their worker profile.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Worker discovery: browse list with category filtering, rate sorting, and worker detail view",
      "synonyms": [
        "Browse workers",
        "Worker directory",
        "Worker detail page"
      ],
      "description": "Displays a grid of active worker profiles with UI controls to filter by service category and sort by hourly rate. Each worker card links to a detailed profile page showing full description, area, and rate.",
      "reqIds": [
        "REQ-13"
      ],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Booking request creation from worker detail",
      "synonyms": [
        "Create booking",
        "Service request"
      ],
      "description": "Clients can request a booking for a selected worker by providing preferred date/time (text), job details, and location. The backend validates worker existence and creates a booking with initial status #requested.",
      "reqIds": [
        "REQ-14"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Booking lifecycle management with authorization constraints",
      "synonyms": [
        "Booking status updates",
        "Accept/decline/cancel/complete"
      ],
      "description": "Implements booking states: requested, accepted, declined, cancelled, completed. Backend enforces transitions: clients may cancel only while requested; workers may accept/decline while requested and complete when accepted. Booking details are restricted to involved parties (or admin). Frontend provides status badges and context-sensitive action buttons on booking detail.",
      "reqIds": [
        "REQ-14"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Role-based dashboards for booking management",
      "synonyms": [
        "Client dashboard",
        "Worker dashboard"
      ],
      "description": "Client dashboard groups bookings into upcoming/active vs past. Worker dashboard shows profile completion status and groups bookings into new requests, accepted, completed, and declined/cancelled. Both dashboards use shared BookingList components linking to booking detail pages.",
      "reqIds": [
        "REQ-15"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Consistent UI theme, responsive layout, and static brand assets",
      "synonyms": [
        "Tailwind theme tokens",
        "shadcn UI styling",
        "Logo/hero assets"
      ],
      "description": "Defines a warm, earthy OKLCH-based theme with custom fonts (Poppins/Inter), reusable UI components, and responsive page layouts. Uses static generated logo and hero illustration from the public assets directory in navigation and the browse hero section.",
      "reqIds": [
        "REQ-10",
        "REQ-18"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-web-app-manifest-for-handyconnect-and-wire-it-into-the-app-so-the-site-is-recognized-as-a-pwa-name-short-name-start-url-display-standalone-theme-color-background-color-icons",
      "title": "Add a Web App Manifest for HandyConnect and wire it into the app so the site is recognized as a PWA (name, short_name, start_url, display=standalone, theme_color, background_color, icons).",
      "reqIds": [
        "REQ-19"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-a-service-worker-that-enables-app-shell-offline-support-by-precaching-the-built-static-assets-and-serving-the-spa-entry-index-html-for-navigation-requests-include-an-offline-fallback-for-uncached-requests-when-the-user-is-offline",
      "title": "Implement a service worker that enables app-shell offline support by precaching the built static assets and serving the SPA entry (index.html) for navigation requests; include an offline fallback for uncached requests when the user is offline.",
      "reqIds": [
        "REQ-20"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-html-entry-point-to-include-required-pwa-metadata-manifest-link-theme-color-meta-and-any-necessary-apple-pwa-meta-tags-and-to-register-the-service-worker-at-runtime-without-editing-frontend-src-main-tsx-or-other-immutable-paths",
      "title": "Update the HTML entry point to include required PWA metadata (manifest link, theme-color meta, and any necessary Apple PWA meta tags) and to register the service worker at runtime (without editing frontend/src/main.tsx or other immutable paths).",
      "reqIds": [
        "REQ-21"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Convert HandyConnect web MVP into a PWA (installable, app manifest + service worker) for mobile home-screen install",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "ICP architecture: a single Motoko canister (actor) exposes query/update methods for user profiles, worker profiles, and bookings.",
    "Authorization is centralized via an AccessControl module and a MixinAuthorization mixin; roles include admin/user/guest with first-admin bootstrap via a secret token.",
    "Frontend is React + TypeScript using TanStack Router for routing and @tanstack/react-query for data fetching/caching/mutations.",
    "Internet Identity integration uses @dfinity/auth-client with a React context provider to persist identity across reloads (delegation TTL set to ~30 days).",
    "Backend actor creation is encapsulated in a custom useActor hook that recreates the actor when identity changes and invalidates/refetches dependent queries.",
    "UI is built on Tailwind + shadcn/ui-style components with design tokens (CSS variables, OKLCH palette) and responsive layouts (desktop + mobile nav).",
    "Static generated assets (logo/hero) are served from frontend/public/assets/generated and referenced directly by the frontend.",
    "Plan to add PWA support (web app manifest + service worker) so HandyConnect can be installed on mobile home screens without generating an APK."
  ],
  "known_issues": [
    "Duplicate providers: QueryClientProvider and InternetIdentityProvider are created both in frontend/src/main.tsx and again inside frontend/src/App.tsx, resulting in nested providers and multiple QueryClient instances.",
    "Canister state is not upgrade-stable: maps and bookingCounter are not stored in stable variables, so data may reset on canister upgrade.",
    "Authorization bootstrap can hard-fail: _initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment.",
    "Backend does not enforce accountType semantics: any authenticated principal can create/update a worker profile and create bookings; the role (client/worker) is only enforced by frontend routing/guards.",
    "Booking route param parsing: useGetBooking does BigInt(bookingId) without validation; non-numeric IDs will throw before reaching the backend.",
    "BrowseWorkers uses client-side filtering/sorting even though backend provides category/rate browse endpoints; may not scale well with many workers.",
    "Worker discovery endpoints return inactive workers; the UI filters isActive client-side, but other consumers could show inactive profiles unless they filter too."
  ],
  "isFixRequest": false,
  "imageRequirements": "## Required Images\n- App icon in a bold, clean handyman/tools marketplace style (pwa-icon-192.dim_192x192.png)\n- App icon in a bold, clean handyman/tools marketplace style (pwa-icon-512.dim_512x512.png)\n- Maskable app icon variant with safe padding around the mark (pwa-icon-maskable-512.dim_512x512.png)",
  "generatedImages": [
    {
      "filename": "pwa-icon-192.dim_192x192.png",
      "description": "App icon in a bold, clean handyman/tools marketplace style",
      "targetWidth": 192,
      "targetHeight": 192
    },
    {
      "filename": "pwa-icon-512.dim_512x512.png",
      "description": "App icon in a bold, clean handyman/tools marketplace style",
      "targetWidth": 512,
      "targetHeight": 512
    },
    {
      "filename": "pwa-icon-maskable-512.dim_512x512.png",
      "description": "Maskable app icon variant with safe padding around the mark",
      "targetWidth": 512,
      "targetHeight": 512
    }
  ],
  "gameProjectType": "none",
  "projectName": "HandyConnect",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}